lab6/app/controllers/lab_reports_controller.rb

SELECT "lab_reports".* FROM "lab_reports"
---
    def index
        @lab_report = LabReport.all

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @lab_report = LabReport.find(params[:id])

INSERT INTO "lab_reports" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "sdfsd"], ["description", "asd"], ["created_at", "2021-05-17 14:45:58.112143"], ["updated_at", "2021-05-17 14:45:58.112143"]]
---
    def create
        # render plain: params[:lab_reports].inspect
        @lab_reports = LabReport.new(lab_reports_params)


        if (@lab_reports.save)

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @lab_reports = LabReport.find(params[:id])

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lab_reports" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "lab_reports"."id" = ?  [["title", "fgfgg"], ["description", "dfgfdg"], ["updated_at", "2021-05-17 14:40:27.883178"], ["id", 1]]
---
    def update
        @lab_reports = LabReport.find(params[:id])
        if (LabReport.find(params[:id]).update(lab_reports_params))

SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lab_reports" WHERE "lab_reports"."id" = ?  [["id", 1]]
---
    def destroy
        @lab_reports = LabReport.find(params[:id])

        @lab_reports.destroy