lab6/app/controllers/marks_controller.rb

    def create
        @lab_report = LabReport.find(params[:lab_report_id])
        @mark = @lab_report.marks.create(mark_params)
---
SELECT "lab_reports".* FROM "lab_reports" WHERE "lab_reports"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "marks" ("points", "letter", "lab_report_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["points", 56], ["letter", "C"], ["lab_report_id", 2], ["created_at", "2021-05-17 15:26:33.025517"], ["updated_at", "2021-05-17 15:26:33.025517"]]