lab6/app/views/lab_reports/index.html.erb

<h1>Labs reports</h1>
<% LabReport.all.each do |lab| %>
---
SELECT "lab_reports".* FROM "lab_reports"