lab6/app/views/lab_reports/show.html.erb


<% @lab_report.marks.each do |mark| %>
---
SELECT "marks".* FROM "marks" WHERE "marks"."lab_report_id" = ?  [["lab_report_id", 2]]